Revit 2016 API
ObjectFactory Members
The ObjectFactory type exposes the following members.
Constructors
Name | Description
ObjectFactory
 For Internal Use Only.
Methods
Name | Description
Dispose
For Internal Use Only.
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
ObjectFactory Class
Autodesk.Revit.DB Namespace